city = [
    "Токио", "Дели", "Мехико", "Сан-Паулу", "Мумбаи", "Пекин", "Дакка", "Каир", "Манила", "Шанхай",
    "Карачи", "Стамбул", "Чунцин", "Буэнос-Айрес", "Чэнду", "Лагос", "Рио-де-Жанейро", "Тяньцзинь", "Киншаса", "Джакарта",
    "Донггуань", "Лос-Анджелес", "Гуанчжоу", "Москва", "Дакка", "Киев", "Лахор", "Бангалор", "Париж", "Богота",
    "Хогхот", "Хайдарабад", "Нью-Йорк", "Сидней", "Сингапур", "Лондон", "Калькутта", "Ченнаи", "Санкт-Петербург", "Берлин",
    "Бейджинг", "Ахмадабад", "Йоханнесбург", "Сучжоу", "Торонто", "Дунгуань", "Шэньчжэнь", "Джидда", "Ханой", "Уханью",
    "Ухань", "Фошань", "Тайбэй", "Рим", "Инчхон", "Барселона", "Мадрид", "Мельбурн", "Харбин", "Нагоя", "Маниле",
    "Стамбул", "Джакарта", "Гуанчжоу", "Бангкок", "Тегеран", "Дели", "Шанхай", "Сеул", "Бейрут", "Тяньцзинь", "Сиань",
    "Гонконг", "Лос-Анджелес", "Куала-Лумпур", "Нинбо", "Каир", "Рио-де-Жанейро", "Чунцин", "Ханчжоу", "Чэнду", "Мехико",
    "Осака", "Шэньян", "Рияд", "Карачи", "Ченнаи", "Чжэнчжоу", "Мумбаи", "Тошкент", "Пуна", "Хефей", "Салоники",
    "Шицзячжуан", "Циндао", "Буэнос-Айрес", "Сиэтл", "Сучжоу", "Лахор", "Казань", "Баку", "Милан", "Чунцин", "Томск",
    "Красноярск", "Нижний Новгород", "Екатеринбург", "Самара", "Омск", "Новосибирск", "Владивосток", "Южно-Сахалинск",
    "Иркутск", "Краснодар", "Волгоград", "Уфа", "Пермь", "Санкт-Петербург", "Москва", "Калининград", "Минск", "Кишинев",
    "Киев", "Харьков", "Донецк", "Львов", "Одесса", "Днепр", "Запорожье", "Николаев", "Мариуполь", "Луганск", "Винница",
    "Полтава", "Черкассы", "Житомир", "Сумы", "Херсон", "Хмельницкий", "Черновцы", "Ровно", "Ивано-Франковск", "Кременчуг"
]